{
  "era": {
    "id": "era_01_apostolic",
    "name": "Apostolic Era",
    "start_year": -4,
    "end_year": 100,
    "description": "The foundational period of Christianity, spanning from the birth of Jesus of Nazareth through the death of the last apostle. This era witnessed the emergence of Christianity from within Second Temple Judaism, the establishment of the early church, and the beginning of the parting of ways between Judaism and Christianity.",
    "key_themes": [
      "Jesus's ministry",
      "Early church formation",
      "Apostolic missions",
      "Jewish context",
      "Temple destruction",
      "Gentile inclusion",
      "Scripture interpretation"
    ],
    "christianity_status": "Emergence from Judaism; spread throughout Roman Empire; development of core doctrines",
    "judaism_status": "Second Temple period; destruction of Temple in 70 AD; emergence of Rabbinic Judaism"
  },
  "events": [
    {
      "id": "evt_birth_of_jesus",
      "title": "Birth of Jesus",
      "year_start": -4,
      "year_end": null,
      "era_id": "era_01_apostolic",
      "event_type": "foundational",
      "traditions_affected": ["Christianity"],
      "location": "Bethlehem, Judea",
      "location_lat": 31.7054,
      "location_lng": 35.2024,
      "summary": "Birth of Jesus of Nazareth during the reign of Herod the Great.",
      "detailed_narrative": "Jesus was born in Bethlehem during the reign of Herod the Great, under Roman occupation. According to the Gospels, Mary and Joseph traveled from Nazareth to Bethlehem due to a census. The birth fulfilled prophecies including Micah 5:2 regarding the Messiah's birth in Bethlehem.",
      "significance": "The incarnation of the Son of God according to Christian theology; the birth of the central figure of Christianity.",
      "scholarly_consensus": "Most scholars date Jesus's birth to c. 6-4 BC based on Herod's death in 4 BC. The exact date and circumstances are debated.",
      "primary_sources": ["Matthew 1:18-25", "Luke 2:1-20", "Josephus on Herod"],
      "scripture_used": ["Micah 5:2", "Isaiah 7:14", "Matthew 1:22-23"],
      "interpretations": {
        "orthodox": "The incarnation of the eternal Word of God, initiating the salvation of humanity through theosis.",
        "catholic": "The Incarnation - God becoming man through the Virgin Mary, Theotokos.",
        "protestant": "God taking on human flesh to accomplish redemption; fulfillment of Old Testament prophecy.",
        "jewish": "Birth of a Jewish teacher; not recognized as Messiah; historical figure.",
        "academic": "Historical birth of Jesus of Nazareth; details in Gospel accounts shaped by theological concerns."
      }
    },
    {
      "id": "evt_john_baptist_ministry",
      "title": "Ministry of John the Baptist",
      "year_start": 27,
      "year_end": 28,
      "era_id": "era_01_apostolic",
      "event_type": "prophetic",
      "traditions_affected": ["Christianity", "Judaism"],
      "location": "Jordan River, Judean Wilderness",
      "location_lat": 31.8360,
      "location_lng": 35.5500,
      "summary": "John the Baptist's prophetic ministry calling Israel to repentance through baptism.",
      "detailed_narrative": "John appeared as an apocalyptic preacher in the Judean wilderness, calling Israel to repentance and baptizing in the Jordan River. He prepared the way for Jesus and baptized him. His ministry attracted large crowds and attention from religious authorities.",
      "significance": "Last of the Old Testament prophetic tradition; prepared the way for Jesus's ministry.",
      "scholarly_consensus": "Josephus independently confirms John's existence and execution by Herod Antipas (Antiquities 18.5.2).",
      "primary_sources": ["Mark 1:1-8", "Matthew 3:1-12", "Josephus Antiquities 18.5.2"],
      "scripture_used": ["Isaiah 40:3", "Malachi 3:1", "Malachi 4:5"],
      "interpretations": {
        "orthodox": "The Forerunner who prepared the way for the Messiah; last prophet of the Old Covenant.",
        "catholic": "The precursor of Christ; model of ascetic life and prophetic witness.",
        "protestant": "Prophet who prepared Israel for the Messiah; emphasized repentance and faith.",
        "jewish": "Historical figure; apocalyptic preacher within Second Temple Jewish diversity.",
        "academic": "Apocalyptic Jewish prophet; possible connections to Essene community."
      }
    },
    {
      "id": "evt_jesus_ministry",
      "title": "Jesus's Public Ministry",
      "year_start": 27,
      "year_end": 30,
      "era_id": "era_01_apostolic",
      "event_type": "foundational",
      "traditions_affected": ["Christianity", "Judaism"],
      "location": "Galilee, Judea, Samaria",
      "location_lat": 32.7940,
      "location_lng": 35.5310,
      "summary": "Approximately three years of teaching, healing, and proclaiming the Kingdom of God.",
      "detailed_narrative": "Jesus's ministry included teaching (Sermon on the Mount, parables), miracle-working (healings, exorcisms, nature miracles), gathering disciples, and proclaiming the arrival of God's Kingdom. He engaged in controversies with religious authorities over Sabbath observance, purity laws, and claims to divine authority.",
      "significance": "Foundation of Christian faith and practice; teachings that would shape Western civilization.",
      "scholarly_consensus": "Ministry occurred during Pilate's prefecture (26-36 AD). Length and chronology debated; typically 1-3 years.",
      "primary_sources": ["Four Gospels", "Josephus Antiquities 18.3.3"],
      "scripture_used": ["Isaiah 61:1-2", "Deuteronomy 18:15-18"],
      "interpretations": {
        "orthodox": "The earthly ministry of the incarnate Logos, revealing God and effecting salvation.",
        "catholic": "Christ's public ministry establishing the Church and the means of grace.",
        "protestant": "Jesus's authoritative teaching and redemptive mission; model for discipleship.",
        "jewish": "Ministry of a Jewish teacher/healer; claims evaluated against Jewish messianic expectations.",
        "academic": "Ministry of an itinerant Jewish teacher; apocalyptic prophet or wisdom teacher debates."
      }
    },
    {
      "id": "evt_crucifixion_resurrection",
      "title": "Crucifixion and Resurrection",
      "year_start": 30,
      "year_end": 30,
      "era_id": "era_01_apostolic",
      "event_type": "foundational",
      "traditions_affected": ["Christianity"],
      "location": "Jerusalem",
      "location_lat": 31.7781,
      "location_lng": 35.2296,
      "summary": "Jesus's execution by crucifixion and resurrection on the third day.",
      "detailed_narrative": "Jesus was arrested, tried before Jewish and Roman authorities, and executed by crucifixion under Pontius Pilate. According to Christian faith, he rose from the dead on the third day and appeared to his disciples over forty days before ascending to heaven.",
      "significance": "Central event of Christian faith; the atoning death and vindicating resurrection of Jesus.",
      "scholarly_consensus": "Crucifixion under Pilate is well-attested (Tacitus, Josephus). Resurrection is a matter of faith; emergence of resurrection belief requires historical explanation.",
      "primary_sources": ["Four Gospels", "1 Corinthians 15:3-8", "Tacitus Annals 15.44", "Josephus Antiquities 18.3.3"],
      "scripture_used": ["Isaiah 53:1-12", "Psalm 22", "Psalm 16:10", "Hosea 6:2"],
      "interpretations": {
        "orthodox": "The Paschal Mystery - Christ's victory over death, opening the path to theosis.",
        "catholic": "Redemptive sacrifice for humanity's sins; foundation of the sacramental system.",
        "protestant": "Penal substitutionary atonement; justification through faith in Christ's finished work.",
        "jewish": "Death of Jesus; resurrection not accepted; did not fulfill messianic expectations.",
        "academic": "Crucifixion historical; resurrection belief among disciples is significant phenomenon requiring explanation."
      }
    },
    {
      "id": "evt_pentecost",
      "title": "Pentecost",
      "year_start": 30,
      "year_end": 30,
      "era_id": "era_01_apostolic",
      "event_type": "foundational",
      "traditions_affected": ["Christianity"],
      "location": "Jerusalem",
      "location_lat": 31.7781,
      "location_lng": 35.2296,
      "summary": "Outpouring of the Holy Spirit on the disciples; birth of the church.",
      "detailed_narrative": "Fifty days after Passover, during the Jewish festival of Shavuot, the Holy Spirit descended on the gathered disciples. They spoke in languages understood by Jewish pilgrims from throughout the Diaspora. Peter preached and about 3,000 were baptized.",
      "significance": "The empowering of the church for mission; fulfillment of Joel 2:28-32.",
      "scholarly_consensus": "Events described in Acts 2 reflect early church's understanding of Spirit-empowerment. Historical core debated.",
      "primary_sources": ["Acts 2:1-41"],
      "scripture_used": ["Joel 2:28-32", "Psalm 16:8-11", "Psalm 110:1"],
      "interpretations": {
        "orthodox": "Descent of the Holy Spirit completing the Trinity's revelation; birth of the Church.",
        "catholic": "The Church's birthday; empowerment for mission and witness.",
        "protestant": "Fulfillment of Jesus's promise of the Spirit; empowerment for gospel proclamation.",
        "jewish": "Not part of Jewish tradition; Shavuot celebrates Torah giving at Sinai.",
        "academic": "Foundational narrative for early church self-understanding; reflects Luke's theology."
      }
    },
    {
      "id": "evt_stephen_martyrdom",
      "title": "Stoning of Stephen",
      "year_start": 34,
      "year_end": 34,
      "era_id": "era_01_apostolic",
      "event_type": "persecution",
      "traditions_affected": ["Christianity"],
      "location": "Jerusalem",
      "location_lat": 31.7781,
      "location_lng": 35.2296,
      "summary": "First Christian martyr; triggered persecution and scattering of believers.",
      "detailed_narrative": "Stephen, a Hellenistic Jewish Christian deacon, was arrested for his preaching. His speech before the Sanhedrin critiqued Israel's history of rejecting God's messengers. He was stoned to death, becoming the first Christian martyr.",
      "significance": "First Christian martyrdom; persecution scattered church, spreading the gospel.",
      "scholarly_consensus": "Martyrdom historically plausible; speech in Acts 7 may reflect early Christian interpretation of Israel's history.",
      "primary_sources": ["Acts 6:8-7:60"],
      "scripture_used": ["Various Old Testament passages in Stephen's speech"],
      "interpretations": {
        "orthodox": "Protomartyr; model of faithful witness unto death; sees Christ at God's right hand.",
        "catholic": "First martyr; patron saint; model of forgiveness of persecutors.",
        "protestant": "Faithful witness; example of Spirit-empowered testimony; catalyst for mission.",
        "jewish": "Execution of a perceived blasphemer within historical context.",
        "academic": "Early instance of intra-Jewish conflict over Jesus movement."
      }
    },
    {
      "id": "evt_paul_conversion",
      "title": "Conversion of Paul",
      "year_start": 34,
      "year_end": 36,
      "era_id": "era_01_apostolic",
      "event_type": "conversion",
      "traditions_affected": ["Christianity"],
      "location": "Road to Damascus",
      "location_lat": 33.5138,
      "location_lng": 36.2765,
      "summary": "Dramatic conversion of Christianity's chief persecutor into its greatest missionary.",
      "detailed_narrative": "Saul of Tarsus, a Pharisee who persecuted Christians, experienced a vision of the risen Christ on the road to Damascus. Blinded and then healed, he was baptized and began preaching Jesus as Messiah.",
      "significance": "Transformation of persecutor into apostle; pivotal for Gentile mission and Christian theology.",
      "scholarly_consensus": "Paul's conversion is historically certain; nature of experience debated (vision, psychological, revelatory).",
      "primary_sources": ["Acts 9:1-19", "Acts 22:6-21", "Acts 26:12-18", "Galatians 1:13-17", "1 Corinthians 15:8-10"],
      "scripture_used": ["Isaiah 49:6 (light to nations)"],
      "interpretations": {
        "orthodox": "Divine call to apostleship; encounter with the risen Lord.",
        "catholic": "Model of conversion and divine grace; call to apostolic mission.",
        "protestant": "Paradigm of conversion by grace; call apart from human works.",
        "jewish": "Apostasy from Judaism; departure from ancestral faith.",
        "academic": "Significant religious experience; transformation from opponent to adherent."
      }
    },
    {
      "id": "evt_council_jerusalem",
      "title": "Council of Jerusalem",
      "year_start": 49,
      "year_end": 49,
      "era_id": "era_01_apostolic",
      "event_type": "council",
      "traditions_affected": ["Christianity"],
      "location": "Jerusalem",
      "location_lat": 31.7781,
      "location_lng": 35.2296,
      "summary": "First church council deciding Gentile converts did not need circumcision.",
      "detailed_narrative": "As Gentiles joined the church through Paul's mission, debate arose about Torah observance. The council, led by James, Peter, and Paul, determined that Gentiles need not be circumcised but should observe minimal requirements (abstain from idolatry, sexual immorality, strangled meat, blood).",
      "significance": "Established framework for Jew-Gentile relations; decisive for Christianity's universal scope.",
      "scholarly_consensus": "Historicity debated; relationship between Acts 15 and Galatians 2 unclear. Represents significant early church decision-making.",
      "primary_sources": ["Acts 15:1-29", "Galatians 2:1-10"],
      "scripture_used": ["Amos 9:11-12", "Genesis 12:1-3"],
      "interpretations": {
        "orthodox": "First ecumenical decision; Spirit-guided conciliarity; model for future councils.",
        "catholic": "Exercise of apostolic authority; precedent for magisterial teaching.",
        "protestant": "Affirmation of gospel of grace; salvation by faith, not works of law.",
        "jewish": "Moment of decisive break; Christianity becomes separate from Judaism.",
        "academic": "Compromise solution to internal conflict; significant for Christian identity formation."
      }
    },
    {
      "id": "evt_paul_journeys",
      "title": "Paul's Missionary Journeys",
      "year_start": 46,
      "year_end": 58,
      "era_id": "era_01_apostolic",
      "event_type": "mission",
      "traditions_affected": ["Christianity"],
      "location": "Asia Minor, Greece, Rome",
      "location_lat": 38.7223,
      "location_lng": 27.1394,
      "summary": "Three missionary journeys establishing churches throughout the Roman Empire.",
      "detailed_narrative": "Paul conducted three major missionary journeys: (1) Cyprus and South Galatia (46-48 AD); (2) Greece and Asia Minor (49-52 AD); (3) Ephesus and Greece (53-57 AD). He also journeyed to Rome as a prisoner (59-62 AD). He established churches and wrote letters that became scripture.",
      "significance": "Spread Christianity throughout Roman Empire; theological development through epistles.",
      "scholarly_consensus": "Journeys generally accepted; chronology reconstructed from Acts and epistles with some debate.",
      "primary_sources": ["Acts 13-28", "Paul's Epistles"],
      "scripture_used": ["Matthew 28:18-20", "Isaiah 49:6", "Genesis 12:3"],
      "interpretations": {
        "orthodox": "Apostolic mission fulfilling Christ's commission; establishment of local churches.",
        "catholic": "Evangelization of the nations; founding of churches under apostolic authority.",
        "protestant": "Model of missionary work; gospel proclamation and church planting.",
        "jewish": "Spread of Christianity outside Judaism; development of separate religion.",
        "academic": "Urban mission strategy; social networks and patronage in early Christianity."
      }
    },
    {
      "id": "evt_temple_destruction",
      "title": "Destruction of the Temple",
      "year_start": 70,
      "year_end": 70,
      "era_id": "era_01_apostolic",
      "event_type": "catastrophe",
      "traditions_affected": ["Christianity", "Judaism"],
      "location": "Jerusalem",
      "location_lat": 31.7781,
      "location_lng": 35.2296,
      "summary": "Roman destruction of the Second Temple, ending Jewish sacrificial worship.",
      "detailed_narrative": "The First Jewish-Roman War (66-73 AD) culminated in the Roman siege and destruction of Jerusalem under General Titus. The Temple, center of Jewish religious life, was burned and demolished on the 9th of Av (August 70 AD). This catastrophic event transformed both Judaism and Christianity.",
      "significance": "End of Temple worship; transformation of Judaism; acceleration of Jewish-Christian separation.",
      "scholarly_consensus": "Well-documented event; Josephus provides eyewitness account. Archaeological evidence confirms destruction.",
      "primary_sources": ["Josephus Jewish War Books 5-6", "Tacitus Histories 5.1-13"],
      "scripture_used": ["Mark 13:1-2", "Luke 21:20-24", "Daniel 9:26"],
      "interpretations": {
        "orthodox": "Fulfillment of prophecy; end of Old Covenant sacrifices; church becomes new Temple.",
        "catholic": "Divine judgment confirming New Covenant; Christ's sacrifice supersedes Temple.",
        "protestant": "Prophetic fulfillment; end of ceremonial law; validation of Christianity.",
        "jewish": "Churban (catastrophe); mourned on Tisha B'Av; beginning of exile; transformation to Rabbinic Judaism.",
        "academic": "Major historical event; reshaped both religions; Josephus primary source."
      }
    },
    {
      "id": "evt_gospel_writing",
      "title": "Writing of the Gospels",
      "year_start": 50,
      "year_end": 90,
      "era_id": "era_01_apostolic",
      "event_type": "literary",
      "traditions_affected": ["Christianity"],
      "location": "Various (Rome, Antioch, Ephesus)",
      "location_lat": null,
      "location_lng": null,
      "summary": "Oral traditions about Jesus committed to writing in four canonical Gospels.",
      "detailed_narrative": "The four canonical Gospels emerged from oral traditions in early Christian communities. Mark (c. 65-70), Matthew (c. 70-85), Luke (c. 75-85), and John (c. 90-100) each present distinctive perspectives on Jesus's life and teaching.",
      "significance": "Preservation of Jesus traditions; foundation of Christian scripture; diversity within unity.",
      "scholarly_consensus": "Markan priority generally accepted; Q hypothesis for Matthew-Luke common material; John independent tradition.",
      "primary_sources": ["Mark", "Matthew", "Luke", "John"],
      "scripture_used": ["Multiple Old Testament citations"],
      "interpretations": {
        "orthodox": "Spirit-inspired scriptures; four perspectives on the one Christ.",
        "catholic": "Apostolic witness preserved; inerrant scripture within Tradition.",
        "protestant": "God-breathed scripture; sufficient authority for faith and practice.",
        "jewish": "Christian texts about Jesus; not part of Jewish canon.",
        "academic": "Literary products of early Christian communities; sources for historical Jesus research."
      }
    },
    {
      "id": "evt_nero_persecution",
      "title": "Persecution under Nero",
      "year_start": 64,
      "year_end": 68,
      "era_id": "era_01_apostolic",
      "event_type": "persecution",
      "traditions_affected": ["Christianity"],
      "location": "Rome",
      "location_lat": 41.9028,
      "location_lng": 12.4964,
      "summary": "First official Roman persecution of Christians following the Great Fire of Rome.",
      "detailed_narrative": "After the Great Fire of Rome (64 AD), Emperor Nero blamed Christians. Tacitus describes horrific punishments: Christians covered in animal skins and torn by dogs, crucified, and set ablaze as human torches. Tradition holds Peter and Paul were martyred during this persecution.",
      "significance": "First state persecution; martyrdom of Peter and Paul; established precedent for later persecutions.",
      "scholarly_consensus": "Persecution well-attested (Tacitus Annals 15.44). Martyrdom of Peter and Paul in Rome accepted by most scholars.",
      "primary_sources": ["Tacitus Annals 15.44", "1 Clement 5-6", "Later martyrdom traditions"],
      "scripture_used": [],
      "interpretations": {
        "orthodox": "Witness of martyrs; blood of martyrs as seed of church.",
        "catholic": "Persecution confirming faith; martyrdom of Peter in Rome supports papal claims.",
        "protestant": "Cost of discipleship; faithfulness unto death; persecution as mark of true church.",
        "jewish": "Roman persecution of another group; parallels with later Jewish persecution.",
        "academic": "Scapegoating of minority group; social-political dynamics of persecution."
      }
    },
    {
      "id": "evt_masada_fall",
      "title": "Fall of Masada",
      "year_start": 73,
      "year_end": 73,
      "era_id": "era_01_apostolic",
      "event_type": "military",
      "traditions_affected": ["Judaism"],
      "location": "Masada, Judean Desert",
      "location_lat": 31.3156,
      "location_lng": 35.3536,
      "summary": "Final act of the First Jewish-Roman War; mass suicide of Jewish defenders.",
      "detailed_narrative": "After Jerusalem's fall, the last Jewish rebels held out at the fortress of Masada until 73 AD. When Roman forces finally breached the walls, they found that most defenders (960 people according to Josephus) had committed mass suicide rather than be captured.",
      "significance": "End of the First Jewish-Roman War; symbol of Jewish resistance in modern Israel.",
      "scholarly_consensus": "Archaeological excavations confirm siege; mass suicide narrative debated but plausible.",
      "primary_sources": ["Josephus Jewish War 7.8-9"],
      "scripture_used": [],
      "interpretations": {
        "orthodox": "Historical event; not specifically theological significance.",
        "catholic": "Historical tragedy; moral complexity of suicide.",
        "protestant": "Historical event; sometimes cited in discussions of religious liberty.",
        "jewish": "Symbol of Jewish resistance; commemorated in modern Israel; complex ethical legacy.",
        "academic": "Archaeological and literary evidence align; significance for Jewish identity."
      }
    },
    {
      "id": "evt_council_jamnia",
      "title": "Council of Jamnia",
      "year_start": 90,
      "year_end": 90,
      "era_id": "era_01_apostolic",
      "event_type": "council",
      "traditions_affected": ["Judaism"],
      "location": "Jamnia (Yavneh), Judea",
      "location_lat": 31.8780,
      "location_lng": 34.7395,
      "summary": "Traditional date for consolidation of Hebrew canon and restructuring of Judaism.",
      "detailed_narrative": "Following the Temple's destruction, Rabban Yochanan ben Zakkai established an academy at Yavneh (Jamnia). Traditional view held this 'council' fixed the Hebrew Bible canon. Modern scholarship sees this as gradual process rather than single event.",
      "significance": "Formation of Rabbinic Judaism; development of Jewish canon; post-Temple Jewish identity.",
      "scholarly_consensus": "Concept of formal 'Council of Jamnia' largely abandoned; academy important but canon formation was gradual.",
      "primary_sources": ["Rabbinic literature references to Yavneh", "Later traditions"],
      "scripture_used": [],
      "interpretations": {
        "orthodox": "Jewish development; parallel to Christian canon formation.",
        "catholic": "Jewish canon formation; different from broader Catholic Old Testament.",
        "protestant": "Relevant to understanding Hebrew canon that Protestants follow.",
        "jewish": "Crucial moment in Jewish survival; Yavneh saved Judaism through Torah study.",
        "academic": "Academy at Yavneh important; 'council' concept outdated; gradual canon formation."
      }
    },
    {
      "id": "evt_john_death",
      "title": "Death of John the Apostle",
      "year_start": 100,
      "year_end": 100,
      "era_id": "era_01_apostolic",
      "event_type": "death",
      "traditions_affected": ["Christianity"],
      "location": "Ephesus",
      "location_lat": 37.9392,
      "location_lng": 27.3419,
      "summary": "Death of the last apostle; end of the apostolic era.",
      "detailed_narrative": "According to church tradition, John the Apostle lived to an advanced age in Ephesus, outliving all other apostles. He is credited with writing the Gospel of John, three epistles, and Revelation. He died during Emperor Trajan's reign (98-117 AD).",
      "significance": "End of apostolic era; transition to sub-apostolic period; closure of apostolic witness.",
      "scholarly_consensus": "Tradition of John in Ephesus early and widespread (Irenaeus); authorship of Johannine corpus debated.",
      "primary_sources": ["Irenaeus Against Heresies 3.3.4", "Eusebius Church History"],
      "scripture_used": [],
      "interpretations": {
        "orthodox": "End of apostolic age; Tradition now carries apostolic witness.",
        "catholic": "Closure of revelation; apostolic succession continues teaching authority.",
        "protestant": "End of foundational generation; Scripture complete and sufficient.",
        "jewish": "Death of early Christian leader; not directly relevant.",
        "academic": "Traditional date; marks transition in early Christian history."
      }
    }
  ],
  "figures": [
    {
      "id": "fig_jesus",
      "name": "Jesus of Nazareth",
      "alternate_names": ["Jesus Christ", "Yeshua", "Jesus the Messiah"],
      "birth_year": -4,
      "death_year": 30,
      "tradition": "Christianity",
      "roles": ["Messiah", "Son of God", "Teacher", "Prophet", "Savior"],
      "biography": "Central figure of Christianity. Born in Bethlehem, raised in Nazareth. Conducted public ministry of teaching, healing, and proclaiming God's Kingdom. Crucified under Pontius Pilate, believed by Christians to have risen from the dead.",
      "key_contributions": [
        "Proclamation of the Kingdom of God",
        "Sermon on the Mount and ethical teaching",
        "Institution of the Lord's Supper",
        "Commissioning of apostles",
        "Redemptive death and resurrection"
      ],
      "controversies": [
        "Claims to divine authority",
        "Sabbath controversies",
        "Temple cleansing",
        "Association with sinners"
      ],
      "related_events": ["evt_birth_of_jesus", "evt_jesus_ministry", "evt_crucifixion_resurrection"]
    },
    {
      "id": "fig_peter",
      "name": "Simon Peter",
      "alternate_names": ["Cephas", "Simon bar Jonah"],
      "birth_year": 1,
      "death_year": 67,
      "tradition": "Christianity",
      "roles": ["Apostle", "Disciple", "Church Leader", "Martyr"],
      "biography": "Originally a fisherman from Bethsaida. Part of Jesus's inner circle. Despite denying Jesus, became leader of the Jerusalem church. Traditionally martyred in Rome under Nero.",
      "key_contributions": [
        "Confession of Jesus as Messiah",
        "Pentecost sermon",
        "Opening gospel to Gentiles",
        "1-2 Peter epistles"
      ],
      "controversies": [
        "Three denials of Jesus",
        "Antioch incident with Paul"
      ],
      "related_events": ["evt_pentecost", "evt_nero_persecution"]
    },
    {
      "id": "fig_paul",
      "name": "Paul of Tarsus",
      "alternate_names": ["Saul of Tarsus", "Apostle to the Gentiles"],
      "birth_year": 5,
      "death_year": 67,
      "tradition": "Christianity",
      "roles": ["Apostle", "Missionary", "Theologian", "Martyr"],
      "biography": "Born a Pharisee in Tarsus, educated under Gamaliel. Initially persecuted Christians. Converted on Damascus road. Conducted missionary journeys establishing churches. Wrote numerous epistles. Martyred in Rome.",
      "key_contributions": [
        "Thirteen canonical epistles",
        "Theology of justification by faith",
        "Church establishment throughout Roman Empire",
        "Christological and ecclesiological development"
      ],
      "controversies": [
        "Conflict with Judaizers",
        "Antioch incident with Peter",
        "Debates about law and grace"
      ],
      "related_events": ["evt_paul_conversion", "evt_council_jerusalem", "evt_paul_journeys", "evt_nero_persecution"]
    },
    {
      "id": "fig_james_brother",
      "name": "James, Brother of Jesus",
      "alternate_names": ["James the Just", "James of Jerusalem"],
      "birth_year": null,
      "death_year": 62,
      "tradition": "Christianity",
      "roles": ["Church Leader", "Author", "Martyr"],
      "biography": "Brother of Jesus who became believer after resurrection. Led Jerusalem church. Presided over Council of Jerusalem. Authored Epistle of James. Martyred in 62 AD according to Josephus.",
      "key_contributions": [
        "Leadership of Jerusalem church",
        "Council of Jerusalem decision",
        "Epistle of James"
      ],
      "controversies": [
        "Relationship between faith and works"
      ],
      "related_events": ["evt_council_jerusalem"]
    },
    {
      "id": "fig_john",
      "name": "John the Apostle",
      "alternate_names": ["John son of Zebedee", "Beloved Disciple"],
      "birth_year": 6,
      "death_year": 100,
      "tradition": "Christianity",
      "roles": ["Apostle", "Evangelist", "Author"],
      "biography": "Son of Zebedee, brother of James. Part of Jesus's inner circle. Traditionally 'the disciple whom Jesus loved.' Lived to old age in Ephesus. Authored Gospel, epistles, and Revelation.",
      "key_contributions": [
        "Gospel of John",
        "1, 2, 3 John epistles",
        "Revelation",
        "High Christology development"
      ],
      "controversies": [
        "Authorship debates"
      ],
      "related_events": ["evt_john_death", "evt_gospel_writing"]
    },
    {
      "id": "fig_mary_mother",
      "name": "Mary, Mother of Jesus",
      "alternate_names": ["Virgin Mary", "Theotokos", "Miriam"],
      "birth_year": -18,
      "death_year": 41,
      "tradition": "Christianity",
      "roles": ["Mother of Jesus", "Theotokos"],
      "biography": "Young woman from Nazareth betrothed to Joseph. Conceived Jesus by the Holy Spirit according to Gospels. Present at crucifixion and Pentecost. Venerated especially in Orthodox and Catholic traditions.",
      "key_contributions": [
        "Mother of Jesus",
        "Model of faith and obedience",
        "Present at key moments in Christ's life"
      ],
      "controversies": [
        "Perpetual virginity debate",
        "Level of veneration appropriate"
      ],
      "related_events": ["evt_birth_of_jesus", "evt_pentecost"]
    },
    {
      "id": "fig_stephen",
      "name": "Stephen",
      "alternate_names": ["Protomartyr", "Stephen the Deacon"],
      "birth_year": null,
      "death_year": 34,
      "tradition": "Christianity",
      "roles": ["Deacon", "Martyr"],
      "biography": "One of seven Hellenistic Jewish Christian deacons. Powerful preacher and miracle worker. Arrested for alleged blasphemy. Delivered speech before Sanhedrin. Stoned to death, becoming first Christian martyr.",
      "key_contributions": [
        "First Christian martyr",
        "Speech reviewing Israel's history",
        "Catalyst for church's expansion"
      ],
      "controversies": [],
      "related_events": ["evt_stephen_martyrdom"]
    },
    {
      "id": "fig_barnabas",
      "name": "Barnabas",
      "alternate_names": ["Joseph of Cyprus"],
      "birth_year": 1,
      "death_year": 61,
      "tradition": "Christianity",
      "roles": ["Apostle", "Missionary"],
      "biography": "Levite from Cyprus originally named Joseph, called Barnabas ('son of encouragement'). Introduced Paul to Jerusalem apostles. Accompanied Paul on first missionary journey. Later worked independently in Cyprus.",
      "key_contributions": [
        "Introduced Paul to apostles",
        "First missionary journey with Paul",
        "Advocated for John Mark"
      ],
      "controversies": [
        "Separation from Paul over John Mark"
      ],
      "related_events": ["evt_paul_journeys"]
    },
    {
      "id": "fig_josephus",
      "name": "Flavius Josephus",
      "alternate_names": ["Joseph ben Matthias"],
      "birth_year": 37,
      "death_year": 100,
      "tradition": "Judaism",
      "roles": ["Historian", "Priest", "Military Leader"],
      "biography": "Jewish priest and military leader who surrendered to Romans during Jewish War. Became Roman citizen under Flavian patronage. Wrote major historical works providing crucial information about first-century Judaism and early Christianity.",
      "key_contributions": [
        "The Jewish War",
        "Antiquities of the Jews",
        "Against Apion",
        "Independent attestation to Jesus, John the Baptist, James"
      ],
      "controversies": [
        "Viewed as traitor by some Jews",
        "Reliability of Testimonium Flavianum debated"
      ],
      "related_events": ["evt_temple_destruction", "evt_masada_fall"]
    },
    {
      "id": "fig_gamaliel",
      "name": "Gamaliel I",
      "alternate_names": ["Rabban Gamaliel the Elder"],
      "birth_year": null,
      "death_year": 50,
      "tradition": "Judaism",
      "roles": ["Rabbi", "Sanhedrin Member", "Teacher"],
      "biography": "Grandson of Hillel, leading Pharisaic teacher and Sanhedrin member. Remembered for counsel regarding early Christians and as Paul's teacher. Honored in Jewish tradition as one of the greatest sages.",
      "key_contributions": [
        "Counsel of toleration (Acts 5:34-39)",
        "Teacher of Paul",
        "Various rabbinic rulings"
      ],
      "controversies": [],
      "related_events": ["evt_paul_conversion"]
    }
  ],
  "scripture_usage": [
    {
      "id": "su_isaiah_53",
      "passage_reference": "Isaiah 53:1-12",
      "passage_text": "Who hath believed our report? and to whom is the arm of the LORD revealed? For he shall grow up before him as a tender plant, and as a root out of a dry ground... He was despised and rejected of men; a man of sorrows, and acquainted with grief... Surely he hath borne our griefs, and carried our sorrows... But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed.",
      "event_id": "evt_crucifixion_resurrection",
      "figure_id": "fig_jesus",
      "usage_year": 30,
      "usage_era_id": "era_01_apostolic",
      "usage_type": "proof-text",
      "usage_context": "Crucifixion and Resurrection",
      "how_used": "Applied to Jesus's suffering, death, and resurrection as fulfillment of prophecy",
      "interpretation_given": "The Suffering Servant is Jesus who bore humanity's sins through his death",
      "faithful_to_original_context": "debated",
      "impact_description": "Central text for Christian atonement theology",
      "perspective_views": {
        "orthodox": "Prophetic anticipation of Christ's redemptive suffering",
        "catholic": "Prediction of Christ's passion and vicarious atonement",
        "protestant": "Key proof-text for penal substitutionary atonement",
        "jewish": "Refers to Israel collectively or righteous remnant, not individual Messiah",
        "academic": "Pre-Christian interpretations varied; Christian reading influential but not original meaning"
      }
    },
    {
      "id": "su_psalm_22",
      "passage_reference": "Psalm 22:1-31",
      "passage_text": "My God, my God, why hast thou forsaken me?... I am poured out like water, and all my bones are out of joint... they pierced my hands and my feet... They part my garments among them, and cast lots upon my vesture.",
      "event_id": "evt_crucifixion_resurrection",
      "figure_id": "fig_jesus",
      "usage_year": 30,
      "usage_era_id": "era_01_apostolic",
      "usage_type": "proof-text",
      "usage_context": "Crucifixion",
      "how_used": "Jesus quoted Psalm 22:1 from the cross; Gospel writers applied various verses to crucifixion details",
      "interpretation_given": "David's psalm prophetically describes the Messiah's crucifixion",
      "faithful_to_original_context": "partial",
      "impact_description": "Shaped Christian understanding of crucifixion as prophesied event",
      "perspective_views": {
        "orthodox": "Messianic prophecy fulfilled in Christ's passion",
        "catholic": "Prophetic psalm; Jesus reciting it reveals crucifixion's meaning",
        "protestant": "Direct prophecy of crucifixion details",
        "jewish": "Davidic psalm of lament; not messianic prediction",
        "academic": "Psalm of individual lament; Christian reading typological rather than predictive"
      }
    },
    {
      "id": "su_joel_2",
      "passage_reference": "Joel 2:28-32",
      "passage_text": "And it shall come to pass afterward, that I will pour out my spirit upon all flesh; and your sons and your daughters shall prophesy, your old men shall dream dreams, your young men shall see visions: And also upon the servants and upon the handmaids in those days will I pour out my spirit.",
      "event_id": "evt_pentecost",
      "figure_id": "fig_peter",
      "usage_year": 30,
      "usage_era_id": "era_01_apostolic",
      "usage_type": "proof-text",
      "usage_context": "Pentecost sermon",
      "how_used": "Peter quoted this passage to explain the Pentecost events",
      "interpretation_given": "The outpouring of the Spirit at Pentecost fulfills Joel's prophecy; the last days have begun",
      "faithful_to_original_context": "partial",
      "impact_description": "Established Pentecost as fulfillment of prophecy; inaugurated eschatology",
      "perspective_views": {
        "orthodox": "Prophetic fulfillment; beginning of the age of the Spirit",
        "catholic": "Pentecost fulfills prophecy; Spirit continues in Church",
        "protestant": "Fulfillment inaugurating church age; some see ongoing, others initial fulfillment",
        "jewish": "Eschatological prophecy not yet fulfilled; awaits future realization",
        "academic": "Apocalyptic prophecy; Christian application reflects their eschatological self-understanding"
      }
    },
    {
      "id": "su_genesis_12",
      "passage_reference": "Genesis 12:1-3",
      "passage_text": "Now the LORD had said unto Abram, Get thee out of thy country... And I will make of thee a great nation, and I will bless thee... and in thee shall all families of the earth be blessed.",
      "event_id": "evt_council_jerusalem",
      "figure_id": "fig_paul",
      "usage_year": 49,
      "usage_era_id": "era_01_apostolic",
      "usage_type": "justification",
      "usage_context": "Council of Jerusalem; Paul's letters",
      "how_used": "Used to argue that Gentile blessing was always God's intention",
      "interpretation_given": "The Abrahamic covenant anticipated the inclusion of all nations through faith",
      "faithful_to_original_context": "yes",
      "impact_description": "Provided scriptural basis for Gentile inclusion without Torah observance",
      "perspective_views": {
        "orthodox": "God's universal plan revealed from beginning",
        "catholic": "Foundation of universal church's mission",
        "protestant": "Gospel preached beforehand to Abraham; justification by faith",
        "jewish": "Promise to Abraham fulfilled through Jewish people; nations blessed through Israel",
        "academic": "Patriarchal promise; Christian reading extends original meaning"
      }
    },
    {
      "id": "su_deut_18",
      "passage_reference": "Deuteronomy 18:15-19",
      "passage_text": "The LORD thy God will raise up unto thee a Prophet from the midst of thee, of thy brethren, like unto me; unto him ye shall hearken... I will raise them up a Prophet from among their brethren, like unto thee, and will put my words in his mouth.",
      "event_id": null,
      "figure_id": "fig_jesus",
      "usage_year": 30,
      "usage_era_id": "era_01_apostolic",
      "usage_type": "proof-text",
      "usage_context": "Early Christian preaching",
      "how_used": "Applied to Jesus as the prophet like Moses (Acts 3:22-23, 7:37)",
      "interpretation_given": "Jesus is the definitive prophet promised by Moses",
      "faithful_to_original_context": "debated",
      "impact_description": "Established Moses-Jesus typology in Christian thought",
      "perspective_views": {
        "orthodox": "Christ as prophet, priest, and king fulfills all Old Testament types",
        "catholic": "Jesus as new Moses giving new law",
        "protestant": "Christ as prophet; Moses typology",
        "jewish": "Refers to succession of prophets generally; not single messianic figure",
        "academic": "Promise of prophetic succession; Christian messianic reading secondary"
      }
    }
  ],
  "sources": {
    "primary_christian": [
      {
        "title": "New Testament",
        "type": "scripture",
        "date": "c. 50-100 AD",
        "relevance": "Primary source for all events and figures"
      },
      {
        "title": "Didache",
        "type": "church_document",
        "date": "c. 50-100 AD",
        "relevance": "Early church order and teaching"
      },
      {
        "title": "1 Clement",
        "type": "epistle",
        "date": "c. 96 AD",
        "relevance": "Letter from Rome mentioning Peter and Paul's martyrdom"
      }
    ],
    "primary_jewish": [
      {
        "title": "Josephus, The Jewish War",
        "type": "history",
        "date": "c. 75 AD",
        "relevance": "Eyewitness account of Temple destruction and Jewish War"
      },
      {
        "title": "Josephus, Antiquities of the Jews",
        "type": "history",
        "date": "c. 93-94 AD",
        "relevance": "References to Jesus, John the Baptist, James"
      },
      {
        "title": "Mishnah",
        "type": "rabbinic",
        "date": "compiled c. 200 AD",
        "relevance": "Contains traditions from Apostolic Era"
      }
    ],
    "primary_roman": [
      {
        "title": "Tacitus, Annals 15.44",
        "type": "history",
        "date": "c. 116 AD",
        "relevance": "Description of Nero's persecution; reference to Christ"
      },
      {
        "title": "Pliny the Younger, Letters 10.96-97",
        "type": "correspondence",
        "date": "c. 112 AD",
        "relevance": "Description of early Christian practices"
      },
      {
        "title": "Suetonius, Lives of the Caesars",
        "type": "biography",
        "date": "c. 121 AD",
        "relevance": "References to Christians and 'Chrestus'"
      }
    ],
    "internet_archive": [
      {
        "title": "The Ante-Nicene Fathers, Vol. 1",
        "identifier": "antenicenefather0010unse_d9i8",
        "publisher": "Eerdmans, 1951",
        "relevance": "Apostolic Fathers texts"
      },
      {
        "title": "The Genuine Works of Flavius Josephus",
        "identifier": "genuineworksfla02havegoog",
        "publisher": "Thomas and Andrews, 1809",
        "relevance": "Complete Josephus translations"
      }
    ],
    "openalex": [
      {
        "title": "Between Memory and History",
        "authors": "Chatonnet & Debie",
        "year": 2023,
        "doi": "https://doi.org/10.12987/yale/9780300253535.003.0002"
      },
      {
        "title": "Inculturation Theology of the Jerusalem Council in Acts 15",
        "authors": "Hilary Mbachu",
        "year": 1995
      },
      {
        "title": "Pilgrimage and Religious Tourism: St. Paul's Route",
        "authors": "Christos Tsironis",
        "year": 2022,
        "doi": "https://doi.org/10.3390/rel13100887"
      }
    ],
    "api_sources": [
      {
        "name": "API.Bible",
        "version": "King James Version",
        "bible_id": "de4e12af7f28f599-02",
        "passages_used": ["Isaiah 53", "Psalm 22", "Joel 2:28-32", "Genesis 12:1-3", "Deuteronomy 18:15-19", "Matthew 28:16-20", "Acts 2:14-21"]
      },
      {
        "name": "Sefaria",
        "texts_used": ["Isaiah 53", "Psalm 22", "Joel 3 (Hebrew)", "Genesis 12:1-3", "Deuteronomy 18:15-22", "Pirkei Avot 1", "Mishnah Sanhedrin 10"]
      }
    ]
  },
  "metadata": {
    "generated_date": "2025-12-08",
    "version": "1.0",
    "apis_used": [
      "Perplexity AI",
      "API.Bible",
      "Sefaria",
      "Semantic Scholar",
      "Internet Archive",
      "OpenAlex"
    ],
    "project": "Historical Faith Narrative",
    "era_number": 1,
    "total_events": 15,
    "total_figures": 10,
    "total_scripture_usage": 5
  }
}
